SET NAMES utf8mb4 COLLATE utf8mb4_0900_ai_ci;

-- 由 students.xlsx 生成：users + student
INSERT IGNORE INTO users (id, name, sex, type, password, phone, email) VALUES
('213230101', '子', TRUE, 'student', '123456', '00000000000', NULL),
('213230102', '丑', TRUE, 'student', '123456', '00000000000', NULL),
('213230103', '寅', FALSE, 'student', '123456', '00000000000', NULL),
('213230104', '卯', FALSE, 'student', '123456', '00000000000', NULL),
('213230105', '辰', TRUE, 'student', '123456', '00000000000', NULL),
('213230106', '巳', FALSE, 'student', '123456', '00000000000', NULL),
('213230107', '午', TRUE, 'student', '123456', '00000000000', NULL),
('213230108', '未', FALSE, 'student', '123456', '00000000000', NULL),
('213230109', '申', FALSE, 'student', '123456', '00000000000', NULL),
('213230110', '酉', FALSE, 'student', '123456', '00000000000', NULL),
('213230111', '戌', TRUE, 'student', '123456', '00000000000', NULL),
('213230112', '亥', TRUE, 'student', '123456', '00000000000', NULL);

INSERT IGNORE INTO student (id, sno, enteryear, major, department) VALUES
('213230101', '09023011', 2023, '计算机科学', '计算机学院'),
('213230102', '71123012', 2023, '软件工程', '计算机学院'),
('213230103', '58123001', 2023, '人工智能', '计算机学院'),
('213230104', '57123002', 2023, '网络安全', '网安学院'),
('213230105', '09J23001', 2023, '计算机科学', '计算机学院'),
('213230106', '57S23001', 2023, '网络安全', '网安学院'),
('213230107', '07Q23001', 2023, '数学', '数学学院'),
('213230108', 'JS125001', 2025, '计算机大类', '计算机学院'),
('213230109', '04023001', 2023, '信息工程', '信息学院'),
('213230110', 'JS325001', 2025, '计算机大类', '网安学院'),
('213230111', '09024001', 2024, '计算机科学', '计算机学院'),
('213230112', '09024002', 2024, '计算机科学', '计算机学院');

